---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.Gutter
source: html/6851692a-988a-3f51-e880-4b4159af173e.htm
---
# Gutter Properties

Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).